In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
inputs = df.drop(['PassengerId','Name','Ticket','Cabin','Embarked','Survived'], axis = 'columns')

In [5]:
inputs

     Pclass     Sex   Age  SibSp  Parch     Fare
0         3    male  22.0      1      0   7.2500
1         1  female  38.0      1      0  71.2833
2         3  female  26.0      0      0   7.9250
3         1  female  35.0      1      0  53.1000
4         3    male  35.0      0      0   8.0500
..      ...     ...   ...    ...    ...      ...
886       2    male  27.0      0      0  13.0000
887       1  female  19.0      0      0  30.0000
888       3  female   NaN      1      2  23.4500
889       1    male  26.0      0      0  30.0000
890       3    male  32.0      0      0   7.7500

[891 rows x 6 columns]

In [6]:
# check columns with null values

inputs.isnull().sum()

Pclass      0
Sex         0
Age       177
SibSp       0
Parch       0
Fare        0
dtype: int64

In [7]:
target = df.Survived

In [8]:
target[:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [9]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [10]:
inputs.head(20)

    Pclass     Sex        Age  SibSp  Parch     Fare
0        3    male  22.000000      1      0   7.2500
1        1  female  38.000000      1      0  71.2833
2        3  female  26.000000      0      0   7.9250
3        1  female  35.000000      1      0  53.1000
4        3    male  35.000000      0      0   8.0500
5        3    male  29.699118      0      0   8.4583
6        1    male  54.000000      0      0  51.8625
7        3    male   2.000000      3      1  21.0750
8        3  female  27.000000      0      2  11.1333
9        2  female  14.000000      1      0  30.0708
10       3  female   4.000000      1      1  16.7000
11       1  female  58.000000      0      0  26.5500
12       3    male  20.000000      0      0   8.0500
13       3    male  39.000000      1      5  31.2750
14       3  female  14.000000      0      0   7.8542
15       2  female  55.000000      0      0  16.0000
16       3    male   2.000000      4      1  29.1250
17       2    male  29.699118      0      0  13.0000
18       3  female  31.000000      1      0  18.0000
19       3  female  29.699118      0      0   7.2250

In [11]:
inputs.isnull().sum()

Pclass    0
Sex       0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [12]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [13]:
inputs=pd.concat([inputs,dummies],axis='columns')

In [14]:
inputs.head(4)

   Pclass     Sex   Age  SibSp  Parch     Fare  female  male
0       3    male  22.0      1      0   7.2500       0     1
1       1  female  38.0      1      0  71.2833       1     0
2       3  female  26.0      0      0   7.9250       1     0
3       1  female  35.0      1      0  53.1000       1     0

In [15]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age  SibSp  Parch     Fare  female  male
0       3  22.0      1      0   7.2500       0     1
1       1  38.0      1      0  71.2833       1     0
2       3  26.0      0      0   7.9250       1     0

In [16]:
from sklearn.model_selection import train_test_split

In [17]:
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [18]:
len(X_train)

712

In [19]:
len(X_test)

179

In [20]:
len(inputs)

891

In [21]:
from sklearn.naive_bayes import GaussianNB

In [22]:
model=GaussianNB()

In [23]:
model.fit(X_train,y_train)

GaussianNB()

In [24]:
model.score(X_train,y_train)

0.7808988764044944

In [25]:
target[:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [26]:
predicted=model.predict(X_test)

In [27]:
from sklearn.metrics import classification_report

In [28]:
print(classification_report(y_test,predicted))

              precision    recall  f1-score   support

           0       0.86      0.83      0.84       111
           1       0.74      0.78      0.76        68

    accuracy                           0.81       179
   macro avg       0.80      0.80      0.80       179
weighted avg       0.81      0.81      0.81       179